In [1]:
import numpy as np
import pandas as pd

### Re-Indexing & Altering Labels

In [2]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [24, 27, 22, 32],
}

df = pd.DataFrame(data, index=['a', 'b', 'c', 'd'])
df

      Name  Age
a    Alice   24
b      Bob   27
c  Charlie   22
d    David   32

In [3]:
df.reindex(['c', 'd', 'a', 'b'])

      Name  Age
c  Charlie   22
d    David   32
a    Alice   24
b      Bob   27

In [4]:
df.reindex(['a', 'b', 'c', 'd', 'e', 'f'])

      Name   Age
a    Alice  24.0
b      Bob  27.0
c  Charlie  22.0
d    David  32.0
e      NaN   NaN
f      NaN   NaN

In [5]:
df

      Name  Age
a    Alice   24
b      Bob   27
c  Charlie   22
d    David   32

### Rename index and columns

In [6]:
df.rename(index = {'a': 'A', 'b': 'B', 'c': 'C', 'd': 'D'}, columns = {'Name': 'Full Name', 'Age': 'Years'})
df

      Name  Age
a    Alice   24
b      Bob   27
c  Charlie   22
d    David   32

### Directly Replace Index or columns Labels

In [8]:
df.index = ['A', 'B', 'C', 'D']
df.columns = ['PersonName', 'PersonAge']

In [7]:
df

      Name  Age
a    Alice   24
b      Bob   27
c  Charlie   22
d    David   32

In [ ]:
data{}